###################################################################

# Created by write_sdc on Tue May 14 01:50:10 2019

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 0
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{alucontrol[2]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{alucontrol[1]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{alucontrol[0]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports alusrca]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{alusrcb[1]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{alusrcb[0]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports iord]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{irwrite[3]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{irwrite[2]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{irwrite[1]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{irwrite[0]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{memdata[7]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{memdata[6]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{memdata[5]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{memdata[4]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{memdata[3]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{memdata[2]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{memdata[1]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{memdata[0]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports memtoreg]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports pcen]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{pcsource[1]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports            \
{pcsource[0]}]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports regdst]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports regwrite]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports clk]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports reset]
set_driving_cell -lib_cell INVX1 -library osu05_stdcells [get_ports const_gnd]
set_fanout_load 8 [get_ports {adr[7]}]
set_fanout_load 8 [get_ports {adr[6]}]
set_fanout_load 8 [get_ports {adr[5]}]
set_fanout_load 8 [get_ports {adr[4]}]
set_fanout_load 8 [get_ports {adr[3]}]
set_fanout_load 8 [get_ports {adr[2]}]
set_fanout_load 8 [get_ports {adr[1]}]
set_fanout_load 8 [get_ports {adr[0]}]
set_fanout_load 8 [get_ports {instr[31]}]
set_fanout_load 8 [get_ports {instr[30]}]
set_fanout_load 8 [get_ports {instr[29]}]
set_fanout_load 8 [get_ports {instr[28]}]
set_fanout_load 8 [get_ports {instr[27]}]
set_fanout_load 8 [get_ports {instr[26]}]
set_fanout_load 8 [get_ports {instr[25]}]
set_fanout_load 8 [get_ports {instr[24]}]
set_fanout_load 8 [get_ports {instr[23]}]
set_fanout_load 8 [get_ports {instr[22]}]
set_fanout_load 8 [get_ports {instr[21]}]
set_fanout_load 8 [get_ports {instr[20]}]
set_fanout_load 8 [get_ports {instr[19]}]
set_fanout_load 8 [get_ports {instr[18]}]
set_fanout_load 8 [get_ports {instr[17]}]
set_fanout_load 8 [get_ports {instr[16]}]
set_fanout_load 8 [get_ports {instr[15]}]
set_fanout_load 8 [get_ports {instr[14]}]
set_fanout_load 8 [get_ports {instr[13]}]
set_fanout_load 8 [get_ports {instr[12]}]
set_fanout_load 8 [get_ports {instr[11]}]
set_fanout_load 8 [get_ports {instr[10]}]
set_fanout_load 8 [get_ports {instr[9]}]
set_fanout_load 8 [get_ports {instr[8]}]
set_fanout_load 8 [get_ports {instr[7]}]
set_fanout_load 8 [get_ports {instr[6]}]
set_fanout_load 8 [get_ports {instr[5]}]
set_fanout_load 8 [get_ports {instr[4]}]
set_fanout_load 8 [get_ports {instr[3]}]
set_fanout_load 8 [get_ports {instr[2]}]
set_fanout_load 8 [get_ports {instr[1]}]
set_fanout_load 8 [get_ports {instr[0]}]
set_fanout_load 8 [get_ports {writedata[7]}]
set_fanout_load 8 [get_ports {writedata[6]}]
set_fanout_load 8 [get_ports {writedata[5]}]
set_fanout_load 8 [get_ports {writedata[4]}]
set_fanout_load 8 [get_ports {writedata[3]}]
set_fanout_load 8 [get_ports {writedata[2]}]
set_fanout_load 8 [get_ports {writedata[1]}]
set_fanout_load 8 [get_ports {writedata[0]}]
set_fanout_load 8 [get_ports zero]
set_load -pin_load 0.1 [get_ports {adr[7]}]
set_load -pin_load 0.1 [get_ports {adr[6]}]
set_load -pin_load 0.1 [get_ports {adr[5]}]
set_load -pin_load 0.1 [get_ports {adr[4]}]
set_load -pin_load 0.1 [get_ports {adr[3]}]
set_load -pin_load 0.1 [get_ports {adr[2]}]
set_load -pin_load 0.1 [get_ports {adr[1]}]
set_load -pin_load 0.1 [get_ports {adr[0]}]
set_load -pin_load 0.1 [get_ports {instr[31]}]
set_load -pin_load 0.1 [get_ports {instr[30]}]
set_load -pin_load 0.1 [get_ports {instr[29]}]
set_load -pin_load 0.1 [get_ports {instr[28]}]
set_load -pin_load 0.1 [get_ports {instr[27]}]
set_load -pin_load 0.1 [get_ports {instr[26]}]
set_load -pin_load 0.1 [get_ports {instr[25]}]
set_load -pin_load 0.1 [get_ports {instr[24]}]
set_load -pin_load 0.1 [get_ports {instr[23]}]
set_load -pin_load 0.1 [get_ports {instr[22]}]
set_load -pin_load 0.1 [get_ports {instr[21]}]
set_load -pin_load 0.1 [get_ports {instr[20]}]
set_load -pin_load 0.1 [get_ports {instr[19]}]
set_load -pin_load 0.1 [get_ports {instr[18]}]
set_load -pin_load 0.1 [get_ports {instr[17]}]
set_load -pin_load 0.1 [get_ports {instr[16]}]
set_load -pin_load 0.1 [get_ports {instr[15]}]
set_load -pin_load 0.1 [get_ports {instr[14]}]
set_load -pin_load 0.1 [get_ports {instr[13]}]
set_load -pin_load 0.1 [get_ports {instr[12]}]
set_load -pin_load 0.1 [get_ports {instr[11]}]
set_load -pin_load 0.1 [get_ports {instr[10]}]
set_load -pin_load 0.1 [get_ports {instr[9]}]
set_load -pin_load 0.1 [get_ports {instr[8]}]
set_load -pin_load 0.1 [get_ports {instr[7]}]
set_load -pin_load 0.1 [get_ports {instr[6]}]
set_load -pin_load 0.1 [get_ports {instr[5]}]
set_load -pin_load 0.1 [get_ports {instr[4]}]
set_load -pin_load 0.1 [get_ports {instr[3]}]
set_load -pin_load 0.1 [get_ports {instr[2]}]
set_load -pin_load 0.1 [get_ports {instr[1]}]
set_load -pin_load 0.1 [get_ports {instr[0]}]
set_load -pin_load 0.1 [get_ports {writedata[7]}]
set_load -pin_load 0.1 [get_ports {writedata[6]}]
set_load -pin_load 0.1 [get_ports {writedata[5]}]
set_load -pin_load 0.1 [get_ports {writedata[4]}]
set_load -pin_load 0.1 [get_ports {writedata[3]}]
set_load -pin_load 0.1 [get_ports {writedata[2]}]
set_load -pin_load 0.1 [get_ports {writedata[1]}]
set_load -pin_load 0.1 [get_ports {writedata[0]}]
set_load -pin_load 0.1 [get_ports zero]
set_max_fanout 1 [get_ports {alucontrol[2]}]
set_max_fanout 1 [get_ports {alucontrol[1]}]
set_max_fanout 1 [get_ports {alucontrol[0]}]
set_max_fanout 1 [get_ports alusrca]
set_max_fanout 1 [get_ports {alusrcb[1]}]
set_max_fanout 1 [get_ports {alusrcb[0]}]
set_max_fanout 1 [get_ports iord]
set_max_fanout 1 [get_ports {irwrite[3]}]
set_max_fanout 1 [get_ports {irwrite[2]}]
set_max_fanout 1 [get_ports {irwrite[1]}]
set_max_fanout 1 [get_ports {irwrite[0]}]
set_max_fanout 1 [get_ports {memdata[7]}]
set_max_fanout 1 [get_ports {memdata[6]}]
set_max_fanout 1 [get_ports {memdata[5]}]
set_max_fanout 1 [get_ports {memdata[4]}]
set_max_fanout 1 [get_ports {memdata[3]}]
set_max_fanout 1 [get_ports {memdata[2]}]
set_max_fanout 1 [get_ports {memdata[1]}]
set_max_fanout 1 [get_ports {memdata[0]}]
set_max_fanout 1 [get_ports memtoreg]
set_max_fanout 1 [get_ports pcen]
set_max_fanout 1 [get_ports {pcsource[1]}]
set_max_fanout 1 [get_ports {pcsource[0]}]
set_max_fanout 1 [get_ports regdst]
set_max_fanout 1 [get_ports regwrite]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports reset]
set_max_fanout 1 [get_ports const_gnd]
create_clock [get_ports clk]  -period 40  -waveform {0 20}
set_clock_latency 0.3  [get_clocks clk]
set_input_delay -clock clk  2  [get_ports clk]
set_input_delay -clock clk  2  [get_ports {alucontrol[2]}]
set_input_delay -clock clk  2  [get_ports {alucontrol[1]}]
set_input_delay -clock clk  2  [get_ports {alucontrol[0]}]
set_input_delay -clock clk  2  [get_ports alusrca]
set_input_delay -clock clk  2  [get_ports {alusrcb[1]}]
set_input_delay -clock clk  2  [get_ports {alusrcb[0]}]
set_input_delay -clock clk  2  [get_ports iord]
set_input_delay -clock clk  2  [get_ports {irwrite[3]}]
set_input_delay -clock clk  2  [get_ports {irwrite[2]}]
set_input_delay -clock clk  2  [get_ports {irwrite[1]}]
set_input_delay -clock clk  2  [get_ports {irwrite[0]}]
set_input_delay -clock clk  2  [get_ports {memdata[7]}]
set_input_delay -clock clk  2  [get_ports {memdata[6]}]
set_input_delay -clock clk  2  [get_ports {memdata[5]}]
set_input_delay -clock clk  2  [get_ports {memdata[4]}]
set_input_delay -clock clk  2  [get_ports {memdata[3]}]
set_input_delay -clock clk  2  [get_ports {memdata[2]}]
set_input_delay -clock clk  2  [get_ports {memdata[1]}]
set_input_delay -clock clk  2  [get_ports {memdata[0]}]
set_input_delay -clock clk  2  [get_ports memtoreg]
set_input_delay -clock clk  2  [get_ports pcen]
set_input_delay -clock clk  2  [get_ports {pcsource[1]}]
set_input_delay -clock clk  2  [get_ports {pcsource[0]}]
set_input_delay -clock clk  2  [get_ports regdst]
set_input_delay -clock clk  2  [get_ports regwrite]
set_input_delay -clock clk  2  [get_ports reset]
set_input_delay -clock clk  2  [get_ports const_gnd]
set_output_delay -clock clk  1.65  [get_ports {adr[7]}]
set_output_delay -clock clk  1.65  [get_ports {adr[6]}]
set_output_delay -clock clk  1.65  [get_ports {adr[5]}]
set_output_delay -clock clk  1.65  [get_ports {adr[4]}]
set_output_delay -clock clk  1.65  [get_ports {adr[3]}]
set_output_delay -clock clk  1.65  [get_ports {adr[2]}]
set_output_delay -clock clk  1.65  [get_ports {adr[1]}]
set_output_delay -clock clk  1.65  [get_ports {adr[0]}]
set_output_delay -clock clk  1.65  [get_ports {instr[31]}]
set_output_delay -clock clk  1.65  [get_ports {instr[30]}]
set_output_delay -clock clk  1.65  [get_ports {instr[29]}]
set_output_delay -clock clk  1.65  [get_ports {instr[28]}]
set_output_delay -clock clk  1.65  [get_ports {instr[27]}]
set_output_delay -clock clk  1.65  [get_ports {instr[26]}]
set_output_delay -clock clk  1.65  [get_ports {instr[25]}]
set_output_delay -clock clk  1.65  [get_ports {instr[24]}]
set_output_delay -clock clk  1.65  [get_ports {instr[23]}]
set_output_delay -clock clk  1.65  [get_ports {instr[22]}]
set_output_delay -clock clk  1.65  [get_ports {instr[21]}]
set_output_delay -clock clk  1.65  [get_ports {instr[20]}]
set_output_delay -clock clk  1.65  [get_ports {instr[19]}]
set_output_delay -clock clk  1.65  [get_ports {instr[18]}]
set_output_delay -clock clk  1.65  [get_ports {instr[17]}]
set_output_delay -clock clk  1.65  [get_ports {instr[16]}]
set_output_delay -clock clk  1.65  [get_ports {instr[15]}]
set_output_delay -clock clk  1.65  [get_ports {instr[14]}]
set_output_delay -clock clk  1.65  [get_ports {instr[13]}]
set_output_delay -clock clk  1.65  [get_ports {instr[12]}]
set_output_delay -clock clk  1.65  [get_ports {instr[11]}]
set_output_delay -clock clk  1.65  [get_ports {instr[10]}]
set_output_delay -clock clk  1.65  [get_ports {instr[9]}]
set_output_delay -clock clk  1.65  [get_ports {instr[8]}]
set_output_delay -clock clk  1.65  [get_ports {instr[7]}]
set_output_delay -clock clk  1.65  [get_ports {instr[6]}]
set_output_delay -clock clk  1.65  [get_ports {instr[5]}]
set_output_delay -clock clk  1.65  [get_ports {instr[4]}]
set_output_delay -clock clk  1.65  [get_ports {instr[3]}]
set_output_delay -clock clk  1.65  [get_ports {instr[2]}]
set_output_delay -clock clk  1.65  [get_ports {instr[1]}]
set_output_delay -clock clk  1.65  [get_ports {instr[0]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[7]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[6]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[5]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[4]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[3]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[2]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[1]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[0]}]
set_output_delay -clock clk  1.65  [get_ports zero]
